app/Models/Model_home.php

SELECT COUNT(*) AS `numrows` FROM `tbl_arsip`
---
    public function tot_arsip()
    {
        return $this->db->table('tbl_arsip')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_dep`
---
    public function tot_dep()
    {
        return $this->db->table('tbl_dep')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_user`
---
    public function tot_user()
    {
        return $this->db->table('tbl_user')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_kategori`
---
    public function tot_kategori()
    {
        return $this->db->table('tbl_kategori')->countAll();