app/Models/Model_kategori.php

    public function alldata()
    {
        return $this->db->table('tbl_kategori')
        ->orderBy('id_kategori','DESC')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_kategori`
ORDER BY `id_kategori` DESC