app/Models/Model_dep.php

SELECT *
FROM `tbl_dep`
ORDER BY `id_dep` DESC
---
    public function alldata()
    {
        return $this->db->table('tbl_dep')
        ->orderBy('id_dep','DESC')
        ->get()
        ->getResultArray();